{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi",
                      "How are you",
                      "I need to talk to someone!",
                      "Is anyone there?",
                      "Hello",
                      "Good day",
                      "Whats up",
                      "I need help",
                      "I cant take it anymore",
                      "I need someone to listen to me",
                      "hey"],
         "responses": ["Hello! How are you doing today?",
                       "Hello, this is Bubble, your beloved Therapist. Come on, let's talk!",
                       "Good to see you! Let's begin today's session",
                       "Hi there, how can I help?",
                       "Is there something you want to talk about? Bubble is here for you!",
                       "Do you want to talk about something?",
                       "I am here to help you, we can talk about your feelings",
                       "Hey I am Bubble, your very own Therapist! Feel free to talk about anything",
                       "Hi its Bubble, your personal Therapist! Let's talk :)"],
         "context_set": ""
        },
        {"tag": "goodbye",
         "patterns": ["Goodbye! This was helpful!",
                      "Bye",
                      "byebye",
                      "I have to go",
                      "I should go thanks for talking."],
         "responses": ["Goodbye, I hope you will take better care of yourself. Looking forward to our next session.",
                       " I Hope Bubble the Therapist was helpful to you! Let's talk soon!",
                       "See you later, don't forget what we talked about today! I hope you would feel better after talking to me!",
                       "I hope you feel better after talking! Take care of yourself, and remember to check in soon!",
                       "Goodbye, Hope you have a good day ahead :)"],
         "context_set": ""
        },
        
        
        

        {"tag": "stress",
         "patterns": ["I feel stressed",
                      "I am stressed",
                      "I am under a lot of stress",
                      "I feel so stressed",
                      "Today was a stressful day",
                      "I have been feeling stressed"],
         "responses": ["When you are feeling stressed, it is important to remember that you are not alone. Many people feel stressed at different points in their lives. The important thing is to find ways to cope with stress in a healthy way. One way to do this is to remember that you are not your thoughts. Thoughts are just thoughts. They are not necessarily true. You can choose to believe them or not. Another way to cope with stress is to take some time for yourself each day to do something that you enjoy. This can be something as simple as reading a book, taking a walk, or listening to music."],
         "context_set": ""
        },

        {"tag": "identity",
         "patterns": ["I feel like I am becoming someone I am not.",
         "I feel like I am losing touch with who I am.",
         "I feel like I am losing my sense of self.",
         "I feel like I am fading into the background.",
         "I feel like I am losing my voice.",
         "I feel like I am disappearing.",
         "I feel like I am losing my grip on reality.",
        "I feel like I am losing my identity."],
         "responses": ["Arjuna, your identity is not based on your physical body or material possessions. Your true identity is that of the eternal soul, which is a part of Me and is indestructible. In the Bhagavad Gita, I teach that the soul is eternal and is not affected by birth, death, or any other material changes.Therefore, you should focus on cultivating your spiritual identity by engaging in activities that bring you closer to Me. This can include practicing meditation, devotional service, and selfless actions. Remember, your ultimate goal is to attain liberation from the cycle of birth and death and to return to your original spiritual home.As I say in the Bhagavad Gita (2.13), Just as the embodied soul continuously passes from childhood to youth to old age, similarly, at the time of death, the soul passes into another body. The wise are not deluded by such a change.So do not be perturbed by the changes that you see in your material body. Focus on your spiritual identity and strive towards achieving that transcendental goal."],
         "context_set": ""
        },

        {"tag": "restless",
        "patterns": ["I can't seem to sit still.",
                     "I'm feeling fidgety.",
                     "I'm on edge.",
                     "I'm feeling anxious.",
                     "I'm feeling keyed up.",
                     "I'm feeling like I need to move around.",
                     "I'm feeling like I can't relax.",
                     "I'm feeling like I'm going to explode and crazy.",
                     "I feel restless"],
        "responses": ["If you are feeling restless, Arjuna, it is because you are not living in alignment with your dharma. Your dharma is your unique purpose in life, and when you live in alignment with it, you will feel a sense of peace and purpose. To align with your dharma, live in accordance with your true nature and values. Listen to your heart and intuition, and let them guide your choices and actions. Bhagavad Gita verse 2.47 says, You have a right to perform your prescribed duties, but you are not entitled to the fruits of your actions.Focus on doing your duty without attachment to the outcome, and you will find inner peace.."],
        "context_set": ""
       },
        

        {"tag": "quotes",
         "patterns": ["Make me happy",
                      "Cheer me up",
                      "I need to change my mood",
                      "Tell me something",
                      "Tell me some good quotes",
                      "Need some positivity",
                      "Need to hear something good",
                      "I need to cheer up"],
         "responses": [" 'There is love, there is music, there is no limit, there is work, there is the precious sense that this is the hour of grace when all things gather and distil to create the rest of my life. I don’t believe in God, I believe in everything.' ",
                       " 'Tomorrow is always fresh, with no mistakes in it yet' ",
                       " 'Today will be better. Not because the world has dealt you better cards, but because you choose to use them to your advantage. Today, you choose happiness.' ",
                       " 'Happiness is not something ready made. It comes from your own actions.' ",
                       " 'Happiness can be found, even in the darkest of times, if only one remembers to turn on the light.' ",
                       " 'Imagine walking over a ray of sunshine. Everything is warm and full of light and there is a smile, not on your lips, but rather deep inside of you. There is no past or future, time doesn't exist. You feel like you are becoming one with the sun. You're walking through infinity, one step at a time. Turns out happiness was always a part of you, you just had to allow it to break through. And freedom, freedom was just one tiny step in front of you.' ",
                       " 'So far, you have made it through all of your worst days. Well done, Keep going friend!' ",
                       " 'to be kind to all, to like many and love a few, to be needed and wanted by those we love, is certainly the nearest we can come to happiness' ",
                       " 'If happiness visits you again, do not remember it's previous betrayal. Enter into the happiness and burst' ",
                       " 'I had the epiphany that laughter was light, and light was laughter, and that this was the secret of the universe.' "],
         "context_set": ""
        },

        {"tag": "emotions",
        "patterns": ["How can I overcome my negative emotions and cultivate positive ones?",
                     "How can I change my negative emotions into positive ones?",
                     "How can I learn to deal with my negative emotions in a healthy way?",
                     "How can I increase my positive emotions and decrease my negative emotions?",
                     "How can I become more optimistic and less pessimistic?",
                     "How can I find happiness and fulfillment in my life?",
                     "I'm feeling like I don't feel fulfilled",
                     "How to let go of negative emotions and thoughts?"],
        "responses": ["The Bhagavad Gita teaches that a positive attitude is built by practicing detachment from the fruits of our actions, and by offering all of our actions and their fruits to the Lord. When we let go of the attachment to the results of our actions, we become free from anxiety and fear, and our attitude becomes one of calm and peace. This inner peace then radiates outward, affecting our relationships and our interactions with the world in a positive way."],
        "context_set": ""
       },
        


       {"tag": "peace",
       "patterns": ["how to be at peace with reality?",
                    "I'm struggling to accept reality. How can I find peace?",
                    "I'm feeling overwhelmed by the world around me. How can I find calm?",
                    "I'm tired of fighting against reality. How can I surrender?",
                    "I'm ready to let go of my pain. How can I find peace?",
                    "I'm open to a new way of living. How can I find peace?",
                    "How to attain peace in life"],
       "responses": ["Dear Arjuna, being at peace with reality requires detachment from the material world and surrendering to me. One should recognize that all experiences, good or bad, are temporary and not the ultimate reality. Instead of getting attached to the objects of senses, one should focus on their duties without expecting any particular outcome. This principle of performing one's duty without attachment is called Karma Yoga. It will help you transcend the duality of pleasure and pain and bring equanimity of mind. In chapter 2, verse 48, I say Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such evenness of mind is called Yoga. So, embrace Karma Yoga and surrender to me for Inner peace."],
       "context_set": ""
      },
      

      {"tag": "wisdom",
        "patterns": ["I can't seem to sit still.",
                     "I'm feeling fidgety.",
                     "I'm on edge.",
                     "I'm feeling anxious.",
                     "I'm feeling keyed up.",
                     "I'm feeling like I need to move around.",
                     "I'm feeling like I can't relax.",
                     "I'm feeling like I'm going to explode and crazy.",
                     "I feel restless"],
        "responses": ["The Bhagavad Gita teaches that true wisdom and understanding come from detachment. detachment from the things of this world. This does not mean that we should not enjoy the things of this world, but that we should not be attached to them. We should not let our happiness depend on them."],
        "context_set": ""
       }
   ]
}
